In [1]:
import pandas as pd
import sqlalchemy as db

In [2]:
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/dw_netflix")
conn = engine.connect()

In [6]:
df_fact = pd.read_sql_table('FactWatchs', con=conn)
df_user = pd.read_sql_query('SELECT * FROM dimUser', con=conn)
df_movie = pd.read_sql('SELECT * FROM dimMovie', con=conn)

In [7]:
df_fact.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     2.8 2024-02-04 04:20:18
1  1002331  80210920     3.9 2024-04-01 22:05:38
2  1002331  81157374     2.3 2024-03-12 18:14:49
3  1002332  80192187     0.4 2024-03-19 06:39:57
4  1002332  80210920     4.2 2024-03-07 21:22:44

In [8]:
df_user.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [9]:
df_movie.head()

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [11]:
# Calcular el rating promedio por pelicula
rating_promedio = df_fact.groupby('movieID')['rating'].mean()
print(f'El promedio de rating es: \n {rating_promedio}')

El promedio de rating es:
 movieID
80192187    2.690
80210920    2.385
81157374    2.980
Name: rating, dtype: float64

In [ ]:
# Calcular el rating promedio por usuario

In [ ]:
# Cuantas veces se vieron las peliculas en un periodo determinado

df_fact['timestamp'] = pd.to_datetime(df_fact['timestamp'])
inicio_periodo = '2024-02-01'
fin_periodo = '2024-02-28'

datos_periodo = df_fact.query(f"timestamp >= '{inicio_periodo}' and timestamp <= '{fin_periodo}'")

datos_periodo.merge(df_movie, on=['movieID'], how='inner')['title'].value_counts()

title
Triple Frontier    13
The Mother          6
Run                 6
Name: count, dtype: int64

In [22]:
df_premium = df_user.query('subscription == "Premium" ').merge(df_fact, on=['userID'], how='left')
df_premium.head()

,userID,username,country,subscription,movieID,rating,timestamp
0,1002331,user123,USA,Premium,80192187,2.8,2024-02-04 04:20:18
1,1002331,user123,USA,Premium,80210920,3.9,2024-04-01 22:05:38
2,1002331,user123,USA,Premium,81157374,2.3,2024-03-12 18:14:49
3,1002333,techMaster,UK,Premium,80192187,2.0,2024-02-16 22:57:49
4,1002333,techMaster,UK,Premium,80210920,0.2,2024-02-10 19:48:20

In [24]:
df_premium.groupby('country')['rating'].mean()

country
Australia     2.500000
Bahamas       2.233333
Italy         2.133333
Mexico        2.233333
NewZealand    2.366667
Norway        3.000000
SouthKorea    2.466667
Spain         2.166667
UK            1.666667
USA           3.000000
Name: rating, dtype: float64

In [27]:
datos_periodo = df_premium.query(f"timestamp >= '{inicio_periodo}' and timestamp <= '{fin_periodo}'")
datos_periodo.groupby('country')['rating'].mean()

country
Australia     4.20
Bahamas       2.30
Italy         3.10
Mexico        3.15
NewZealand    2.20
SouthKorea    2.00
Spain         3.10
UK            1.10
USA           2.80
Name: rating, dtype: float64